# Создать список из отдельных символов, преобразовать в строку, инвертировать и  вывести на печать:

list = ['s', 'l', 'i', 'k', 'S', 'e', 'M', 'h', 'c', 'a', 'e', 'T', '_', 'в', '_', 'ь', 'с', 'у', 'ч', 'у', '_', 'я']

sentence = "".join(reversed(list))

print(sentence)
